# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# *Пример:*
# - 6782 -> 23
# - 0,56 -> 11

# n = float(input("Введите число: "))
# a = len(str(n)) - 2
# n = int(n * 10 ** a)
# sum = 0
# while n > 0:
#     sum = int(sum + n % 10)
#     n = n / 10
# print(sum)


# ___________________________________________________________________________________________________________________________________________________________________________________________________________________________________

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# *Пример:*
# пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


num = int(input('Введите число: '))

if num <= 1:
    print("Введненное число не соответсвует условию задачи!")
else:
    com_num = []
    x = 1
    for i in range(1, num+1):
        x *= i
        com_num.append(x)

    print(com_num)

# ___________________________________________________________________________________________________________________________________________________________________________________________________________________________________

# Задайте список из n чисел последовательности 〖(1+1/n)〗^n и выведите на экран их сумму.
# from random import randint

num = int(input('Введите число длины списка: '))
if num < 1:
    print("Длина списка не соответвует условию задачи")
else:
    list = []
    x = 0
    for i in range(1, num + 1):
        formula_num = (1+1/i) ** i
        list.append(formula_num)
        x += formula_num

    print(list)
    print(x)


# ___________________________________________________________________________________________________________________________________________________________________________________________________________________________________


# # Напишите программу, которая принимает на вход 2 числа. Задайте список из N элементов,
#  заполненных числами из
# промежутка [-N, N]. Найдите произведение элементов на указанных позициях(не индексах).

num = int(input('Введите число N: '))
x = int(input('Введите индекс первого числа: '))
b = int(input('Введите индекс второго числа: '))
list_num = []
for i in range(-num, num+1):
    list_num.append(i)

print(list_num)
if x > len(list_num) and b > len(list_num):
    print('Введенный индекс больше длины списка!')
else:
    print('произведение элементов = ', list_num[x - 1] * list_num[b - 1])


# ___________________________________________________________________________________________________________________________________________________________________________________________________________________________________
# Реализуйте алгоритм перемешивания списка.

from random import shuffle
x = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
shuffle(x)
print(x)
