
# ________________________________________________________________________________________________________________
# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# 70 = 2*5*7 => [2, 5, 7]
# 140 = 2*2*5*7 => [2, 2, 5, 7]

x = int(input("Введите просто число: "))
i = 2
lst = []
temp = x
while i <= temp:
    if not temp % i:
        lst.append(i)
        temp //= i
    else:
        i += 1
print(f"прост множетель {x}приведены в списке: {lst}")

# ________________________________________________________________________________________________________________
# Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.

lst = list(map(int, input('Введите числа через пробел:\n').split()))
print(f'Исходный список: {lst}')
new_lst = []
for i  in lst:
    if i not in new_lst:
        new_lst.append(i)
new_lst.sort()
print(new_lst)
________________________________________________________________________________________________________________

# Задана натуральная степень k. Сформировать случайным образом список коэффициентов (значения от 0 до 100)
# многочлена и записать в файл многочлен степени k и приравняйте его к нулю.
# Пример:
# k=2 => 2x² + 4x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
# 2*x*2 + 4*x + 5 = 0
# или
# 2*x^2 + 4*x + 5 = 0

import random

k = int(input("Введите натуральную степень k = "))


def create_str(sp):
    lst = sp[::-1]
    wr = ''
    if len(lst) < 1:
        wr = 'x = 0'
    else:
        for i in range(len(lst)):
            if i != len(lst) - 1 and lst[i] != 0 and i != len(lst) - 2:
                wr += f'{lst[i]}x^{len(lst) - i - 1}'
                if lst[i+1] != 0:
                    wr += ' + '
            elif i == len(lst) - 2 and lst[i] != 0:
                wr += f'{lst[i]}x'
                if lst[i+1] != 0:
                    wr += ' + '
            elif i == len(lst) - 1 and lst[i] != 0:
                wr += f'{lst[i]} = 0'
            elif i == len(lst) - 1 and lst[i] == 0:
                wr += ' = 0'
    return wr


koef = [random.randint(0, 101) for i in range(k + 1)]
result = create_str(koef)
with open('file.txt', 'w') as text:
    text.write(result)
print(result, '\n\n')


# ________________________________________________________________________________________________________________







